## Scratch: dynamodb
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.reliability_queue will be created
  + resource "aws_dynamodb_table" "reliability_queue" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "SubmissionID"
      + id               = (known after apply)
      + name             = "ReliabilityQueue"
      + stream_arn       = (known after apply)
      + stream_enabled   = false
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }

      + attribute {
          + name = "SubmissionID"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = true
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = "arn:aws:kms:ca-central-1:722713121070:key/e53bff47-6a78-4484-9cda-ebb202b016f1"
        }
    }

  # aws_dynamodb_table.vault will be created
  + resource "aws_dynamodb_table" "vault" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "FormID"
      + id               = (known after apply)
      + name             = "Vault"
      + range_key        = "SubmissionID"
      + stream_arn       = (known after apply)
      + stream_enabled   = false
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }

      + attribute {
          + name = "FormID"
          + type = "S"
        }
      + attribute {
          + name = "SubmissionID"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = true
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = "arn:aws:kms:ca-central-1:722713121070:key/e53bff47-6a78-4484-9cda-ebb202b016f1"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

9 tests, 9 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
